# Actualizar filas y columnas en Series y Data Frame

In [1]:
import numpy as np
import pandas as pd

In [2]:
# Vamos a crear un diccionario para utilizarlo como ejemplo
people = {
    "first":["Andres", "Omar", "Miguel"],
    "last":["Galarraga", "Vizquel", "Cabrera"],
    "email":["andres@gmail.com", "omar@email.com", "miguel@email.com"]
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

    first       last             email
0  Andres  Galarraga  andres@gmail.com
1    Omar    Vizquel    omar@email.com
2  Miguel    Cabrera  miguel@email.com

In [5]:
# Para ver las columnas, utilizamos el método df.columns
df.columns

Index(['first', 'last', 'email'], dtype='object')

## ¿Cómo cambiar/actualizar el nombre de una columna?

### 1. Utilizamos el metodo "columns" y pasamos una lista con los nombres nuevos

In [33]:
df.columns = ['nombre_first', 'apellido_last', 'correo_email']

In [34]:
df

  nombre_first apellido_last        correo_email
0       Andres     Galarraga    andres@gmail.com
1         Omar       Vizquel      omar@email.com
2       Miguel       Cabrera  bobabreu@email.com

### 2. Cambiar elementos particulares del nombre de cada columna (mayusculas, minusculas, guiones, etc)

In [14]:
# Podemos pasar los nombres de las columnas a mayusculas con un bucle FOR y el metodo "upper"
df.columns = [x.upper() for x in df.columns]

In [15]:
df

  NOMBRE_FIRST APELLIDO_LAST      CORREO_EMAIL
0       Andres     Galarraga  andres@gmail.com
1         Omar       Vizquel    omar@email.com
2       Miguel       Cabrera  miguel@email.com

In [20]:
# Podemos cambiar el guion bajo, por un guion comun en el nombre, utilizando un metodo "str.replace"
df.columns = df.columns.str.replace('_', '-')

In [21]:
df

  NOMBRE-FIRST APELLIDO-LAST      CORREO-EMAIL
0       Andres     Galarraga  andres@gmail.com
1         Omar       Vizquel    omar@email.com
2       Miguel       Cabrera  miguel@email.com

In [22]:
# Vamos a cambiar nuevamente el nombre de las columnas a minusculas
df.columns = [x.lower() for x in df.columns]

In [23]:
# Y ponerle el guion bajo
df.columns = df.columns.str.replace('-', '_')

In [24]:
df

  nombre_first apellido_last      correo_email
0       Andres     Galarraga  andres@gmail.com
1         Omar       Vizquel    omar@email.com
2       Miguel       Cabrera  miguel@email.com

### 3. Cambiar el nombre o caracteristicas de una sola columna - df.rename()

In [25]:
# Podemos cambiar los nombres utilizando un diccionario key (nombre viejo): value (nombre nuevo)
# Para que el metodo se aplique, debemos utilizar "inplace=True"
df.rename(columns = {'nombre_first': 'first', 'apellido_last': 'last'}, inplace=True)

In [26]:
df

    first       last      correo_email
0  Andres  Galarraga  andres@gmail.com
1    Omar    Vizquel    omar@email.com
2  Miguel    Cabrera  miguel@email.com

In [27]:
# Hagamos lo mismo para la ultima columna
df.rename(columns = {'correo_email':'email'}, inplace = True)
df

    first       last             email
0  Andres  Galarraga  andres@gmail.com
1    Omar    Vizquel    omar@email.com
2  Miguel    Cabrera  miguel@email.com

## ¿Cómo cambiar/actualizar valores de una fila?

### 1. Cambiar los valores de una fila, utilizando una lista

In [28]:
# Podemos seleccionar la fila, y pasar una lista con los valores nuevos
df.loc[2]

first              Miguel
last              Cabrera
email    miguel@email.com
Name: 2, dtype: object

In [29]:
df.loc[2] = ['Bob', 'Abreu', 'bobabreu@email.com']

In [30]:
df

    first       last               email
0  Andres  Galarraga    andres@gmail.com
1    Omar    Vizquel      omar@email.com
2     Bob      Abreu  bobabreu@email.com

### 2. Cambiar varios los valores de una fila, seleccionando columnas especificas con .loc

In [35]:
# Podemos hacer cambios en columnas especificas, selecionandolas con ".loc" [fila, columna]
df.loc[2, ['first', 'last']] = ['Miguel', 'Cabrera']

In [37]:
df

  nombre_first apellido_last        correo_email   first     last
0       Andres     Galarraga    andres@gmail.com     NaN      NaN
1         Omar       Vizquel      omar@email.com     NaN      NaN
2       Miguel       Cabrera  bobabreu@email.com  Miguel  Cabrera

In [41]:
df.rename(columns = {'nombre_first': 'first', 'apellido_last': 'last', 'correo_email': 'email'}, inplace=True)

In [42]:
df

    first       last               email
0  Andres  Galarraga    andres@gmail.com
1    Omar    Vizquel      omar@email.com
2  Miguel    Cabrera  bobabreu@email.com

### 3. Cambiar un solo valor de una fila con .loc

In [47]:
#Seleccionamos la fila y la columna con df.loc [fila, columna]
df.loc[2, 'email'] = 'miguel@email.com' 

# Para cambiar un solo valor tambien podemos utilizar el metodo "df.at", pero el resultado y la sintaxis son identicas
# df.at[2, 'email'] = 'miguel@email.com'

In [46]:
df

    first       last             email
0  Andres  Galarraga  andres@gmail.com
1    Omar    Vizquel    omar@email.com
2  Miguel    Cabrera  miguel@email.com

### 4. Cambiar los valores de varias filas al mismo tiempo

In [50]:
# Para hacer cambios en varias filas, podemos utilizar metodos de "str"
# Primero seleccionamos la columna, y luego aplicamos los cambios a todas las filas
# Vamos a poner los apellidos en minuscula

df['last'] = df['last'].str.lower()

In [51]:
df

    first       last             email
0  Andres  galarraga  andres@gmail.com
1    Omar    vizquel    omar@email.com
2  Miguel    cabrera  miguel@email.com

### 5. Metodos para realizar cambios a multiples filas en pandas

#### 5.1 apply (funciona en Series/columnas)
#### 5.2 applymap (funciona solo Data Frame)
#### 5.3 map (funciona solo para Series)
#### 5.4 replace

### 5.1 apply()

#### Se utiliza para aplicar una funcion a todos los valores (filas), puede utilizarse en Series y Data Frame

In [53]:
# apply() en Series
# Podemos utilizar apply() para contar la cantidad de letras que tiene la direccion de email de cada registro (metodo "len")
# df[columna].apply(metodo)
df['email'].apply(len)

0    16
1    14
2    16
Name: email, dtype: int64

In [54]:
# Podemos escribir una funcion y luego pasarla con apply() a toda la columna
# Crearemos una funcion para poner el email en mayuscula
def update_email (email):
    return email.upper()

In [55]:
df['email'].apply(update_email)

0    ANDRES@GMAIL.COM
1      OMAR@EMAIL.COM
2    MIGUEL@EMAIL.COM
Name: email, dtype: object

In [56]:
# Para que la funcion se aplique al Data Frame, debemos sobrescribir la columna
df['email'] = df['email'].apply(update_email)

In [57]:
df

    first       last             email
0  Andres  galarraga  ANDRES@GMAIL.COM
1    Omar    vizquel    OMAR@EMAIL.COM
2  Miguel    cabrera  MIGUEL@EMAIL.COM

In [58]:
# Otra forma de hacerlo, es aplicando funciones lambda
# Podemos convertir los email de nuevo a minuscula con una funcion lambda
df['email'] = df['email'].apply(lambda x: x.lower())

In [59]:
df

    first       last             email
0  Andres  galarraga  andres@gmail.com
1    Omar    vizquel    omar@email.com
2  Miguel    cabrera  miguel@email.com

### 5.2 applymap()

#### Se utiliza para aplicar operaciones o funciones, a todos los valores del Data Frame

In [60]:
# Por ejemplo, podemos aplicar la funcion "len" a todo el Data Frame y saber la longitud de todas las palabras
df.applymap(len)

   first  last  email
0      6     9     16
1      4     7     14
2      6     7     16

In [61]:
# Tambien podemos, aplicar un metodo de str, para poner todos los textos en minusculas
df.applymap(str.lower)

    first       last             email
0  andres  galarraga  andres@gmail.com
1    omar    vizquel    omar@email.com
2  miguel    cabrera  miguel@email.com

### 5.3 map()

#### El metodo sustituye un valor en la serie, con un nuevo valor

In [64]:
# Para aplicar la funcion map() debemos utilizar un diccionario: key (valor nuevo): values (valor viejo)
# df['columna'].map({key:value, key1:value1})
df['last'].map({'altuve':'galarraga', 'amarista':'vizquel'})

# Los valores que no se agreguen quedaran representados como "NaN"

0    NaN
1    NaN
2    NaN
Name: last, dtype: object

In [65]:
df

    first       last             email
0  Andres  galarraga  andres@gmail.com
1    Omar    vizquel    omar@email.com
2  Miguel    cabrera  miguel@email.com

In [67]:
df['first'].map({'altuve':'Andres', 'amarista':'Omar'})

0    NaN
1    NaN
2    NaN
Name: first, dtype: object

### 5.4 replace()

#### A diferencia de map(), con la funcion replace() se conservan los valores y no se convierten en NaN

In [69]:
df['first'].replace({'altuve':'Andres', 'amarista':'Omar'})

0    Andres
1      Omar
2    Miguel
Name: first, dtype: object